app/controllers/admin_relatorio_controller.rb

  def publico_index
    @relatorios = Relatpublico.all

    @users = User.find(params[:id])
---
SELECT `relatpublicos`.* FROM `relatpublicos`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def centro_index
    @relatorios = Relatorio.all

    @users = User.find(params[:id])
---
SELECT `relatorios`.* FROM `relatorios`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1